def number_to_words(n):
    number1 = ('ноль','один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять')
    number2 = (None, 'десять', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят',
               'девяносто')
    number3 = (None, 'одинадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать',
               'семнадцать', 'восемнадцать', 'девятнадцать')
    number4 = (None, 'сто', 'двести', 'триста', 'четыреста', 'пятьсот', 'шестьсот', 'семьсот', 'восемьсот',
               'девятьсот')
    n1 = n % 10
    n2 = n - n1
    d = n / 10
    if n < 10:
        return number1[n]
    elif 10 < n < 20:
        return number3[n - 10]
    elif n >= 10 and d.is_integer() and number2[int(d)] in number2:
        return number2[int(d)]
    else:
        return number2[int(n2 / 10)] + ' ' + number1[n1]


